tutorials/A.Jacobsen_2025/caseB/constant/porousProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


as_Ne		4280;//120;
as_Pe		4280;//120;
D_pore_Ne		0.06e-3;
D_pore_Pe		0.06e-3;
sigma_s_ref	1.43e7;




// ************************************************************************* //
