tutorials/A.Jacobsen_2025/caseB/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-3;



Ny		60.0;
Nz		1;
tPe		1.8;
tDi		0.85;
tNe		1.8;
cellLength	100.0;
cellDepth	30;
inletL		5;
outletL		5;

S1 5;
SDi	1.2;

t2 #eval #{ $tPe+$tDi #};
t3 #eval #{ $tPe+$tDi+$tNe #};
inletx #eval #{ -1*$inletL #};
outletx	#eval #{ $cellLength+$outletL #};

dyPe	9.810614353358806;
dyNe	9.810614353358806;

dyDiNe	7.0019734877704085;	
dyDiPe	7.0019734877704085;

dx	2;


Nx  #eval #{ round($cellLength/($t3*$S1) *$Ny) #};
NInlet  #eval #{ round($inletL/($t3*$S1) *$Ny) #};
NOutlet  #eval #{ round($outletL/($t3*$S1) *$Ny) #};


NyPE #eval #{ round($tPe/($t3)*$Ny) #};
NyNE #eval #{ round($tNe/($t3)*$Ny) #};
NyD #eval #{ round($tDi/($t3)*$Ny*$SDi) #};

vertices
(
//positiveElectrode
    (0 			0 		0)   		//0
    ($cellLength 	0 		0)		//1
    ($cellLength 	$tPe 		0)		//2
    (0 			$tPe		0)		//3
    (0 			0 		$cellDepth)	//4
    ($cellLength 	0 		$cellDepth)	//5
    ($cellLength 	$tPe 		$cellDepth)	//6
    (0 			$tPe 		$cellDepth)	//7
//diaphrame    
    (0 			$t2		0)   		//8
    ($cellLength 	$t2 		0)		//9
    (0	 		$t2  		$cellDepth)	//10
    ($cellLength	$t2		$cellDepth)	//11
//negativeDiaphram
    (0 			$t3		0)		//12
    ($cellLength 	$t3 		0)		//13
    (0	 		$t3 		$cellDepth)	//14
    ($cellLength 	$t3 		$cellDepth)	//15
//positive inlet
    ($inletx		0		0)		//16
    ($inletx		$tPe		0)		//17
    ($inletx		0		$cellDepth)	//18
    ($inletx		$tPe		$cellDepth)	//19
//positive outlet
    ($outletx		0		0)		//20
    ($outletx		$tPe		0)		//21
    ($outletx		0		$cellDepth)	//22
    ($outletx		$tPe		$cellDepth)	//23
//negative inlet
    ($inletx		$t2		0)		//24
    ($inletx		$t3		0)		//25
    ($inletx		$t2		$cellDepth)	//26
    ($inletx		$t3		$cellDepth)	//27

//negative outlet
    ($outletx		$t2		0)		//28
    ($outletx		$t3		0)		//29
    ($outletx		$t2		$cellDepth)	//30
    ($outletx		$t3		$cellDepth)	//31
);

blocks
(
    hex (0 1 2 3 4 5 6 7) 	positiveElectode 	($Nx $NyPE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
    hex (3 2 9 8 7 6 11 10) 	diaphram 		($Nx $NyD $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyDiPe)(0.5 0.5 #eval #{ 1/$dyDiNe #}))  1)
    hex (8 9 13 12 10 11 15 14) negativeElectode 	($Nx $NyNE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
    hex (16 0 3 17 18 4 7 19) positiveChannel	($NInlet $NyPE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
    hex (24 8 12 25 26 10 14 27) negativeChannel	($NInlet $NyNE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
    hex (1 20 21 2 5 22 23 6) positiveChannel	($NOutlet $NyPE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
    hex (9 28 29 13 11 30 31 15) negativeChannel	($NOutlet $NyNE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
);
//x - ((0.1 0.15 4)(0.8 0.7 1)(0.1 0.15 0.25))
//y - ((0.2 0.3 4)(0.6 0.4 1)(0.2 0.3 0.25)) 
edges
(
);

boundary
(
    PNe
    {
        type wall;
        faces
        (
            (12 14 15 13)
        );
    }
    PPe
    {
	type wall;
	faces
	(
	    (1 5 4 0)
	);
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (2 3 8 9)
            (9 8 12 13)
            (7 10 11 6)
            (11 10 14 15)
            (1 20 21 2)
            (5 22 23 6)
            (9 28 29 13)
            (11 30 31 15)
            (24 8 12 25)
            (26 10 14 27)
            (16 0 3 17)
            (18 4 7 19)
        );
    }
    Outlet1
    {
        type patch;
        faces
        (
            (20 21 23 22)
        );
    }
    Outlet2
    {
        type patch;
        faces
        (
            (28 29 31 30)
        );
    }
    Inlet1
    {
        type patch;
        faces
        (
            (16 17 19 18)
        );
    }
    Inlet2
    {
        type patch;
        faces
        (
                (24 25 27 26)
        );
    }

    Walls
    {
    	type wall;
    	faces
    	(
    	      (2 9 11 6)
    	      (7 10 8 3)
    	      (16 0 4 18)
    	      (17 3 7 19)
    	      (24 8 10 26)
    	      (25 12 14 27)
    	      (1 20 22 5)
    	      (6 21 23 2)
    	      (9 28 30 11)
    	      (13 29 31 15)
        );
    }

    
);


// ************************************************************************* //
