tutorials/A.Jacobsen_2025/caseB/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     currentTransport;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep 	yes;
maxCo 		1;
maxDeltaT	0.05;


functions
{
 #includeFunc conversionRatioH2
 #includeFunc conversionRatioO2
	PWall_Ne
	{
	name    PNe;
	fields  (INe UNe);

	operation areaAverage;

	type            surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");

	writeControl    runTime;
	writeInterval   0.5;

	writeFields     false;
	log             false;

	regionType  patch;
	}
	PWall_Pe
	{
	name    PPe;
	fields  (IPe UPe);

	operation areaAverage;

	type            surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");

	writeControl    runTime;
	writeInterval   0.5;

	writeFields     false;
	log             false;

	regionType  patch;
	}
}
// ************************************************************************* //
