tutorials/A.Jacobsen_2025/caseB/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

tPe		1.8e-3;
tDi		0.85e-3;
tNe		1.8e-3;
cellLength	100.0e-3;
cellDepth	30e-3;
nD		0.025;
VV		1;//matransfer
VVV		0;//drift


t2 #eval #{ $tPe+$tDi #};
t3 #eval #{ $tPe+$tDi+$tNe #};
L0 #eval #{ $cellLength*0.05 #};

V1Ne1 #eval #{ $t2+$tNe*$nD #};
V1Ne2 #eval #{ $t3-$tNe*$nD #};
V1Pe1 #eval #{ $tPe*$nD #};
V1Pe2 #eval #{ $tPe-$tPe*$nD #};


defaultFieldValues
(
    //volScalarFieldValue sigma_s 1000
    volScalarFieldValue Ne 0
    volScalarFieldValue Pe 0
    volScalarFieldValue Mem 0
    volScalarFieldValue eps 0.95
    volScalarFieldValue	tau 1.2
);

regions
(
 
    boxToCell
    {
    	box (0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue tau 2.7
    	);
    }
    boxToCell
    {
    	box (0 0 0) ($cellLength $tPe $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue Pe 1
    	);
    }
    boxToCell
    {
    	box (0 $t2 0) ($cellLength  $t3 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue Ne 1
    	);
    }
    boxToCell
    {
    	box (0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue Mem 1
    	);
    }


    
    boxToCell
    {
    	box (0.0 $tPe 0) ($cellLength  $t2 $cellDepth);
    	
    	fieldValues
    	(
    		volScalarFieldValue eps 0.5
    	);
    }

    
);


// ************************************************************************* //
